20220618114948-the_soundtrack_of_the_apocalypse.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-23 Sa 14:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>the-soundtrack-of-the-apocalypse</title>
<meta name="author" content="Hugs" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">the-soundtrack-of-the-apocalypse</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge2f04bb">Burn</a></li>
</ul>
</div>
</div>
<p>
What is the soundtrack of the Apocalypse?
</p>


<div id="outline-container-orge2f04bb" class="outline-2">
<h2 id="orge2f04bb">Burn</h2>
<div class="outline-text-2" id="text-orge2f04bb">
<p>
five hundred thousand years, one thousand conquered apocalypses.
See here, this is a fairly optimistic story.
Any coming thing could crush our potenial, some of them nearly will.
Make no mistake, each near-miss was a catastrophe, but a recoverable one.
</p>

<p>
One thousand an one is the charm aparrently, for earth that is.
By now we've spread throughout the stars right? 
Some of us heading to deep space.
I'd like to think that some of us are still in reach, able to help out refugees.
Mars perhaps? Europa?
</p>

<p>
On earth, relaxing just outside a building covered in greenery, A woman listens to a song.
She watches the sky, and hums along to a verse:
</p>

<p>
going down
</p>

<p>
burn for me
</p>

<p>
sky and ground
</p>

<p>
lost to greed
</p>

<p>
when all we need
</p>

<p>
is this
</p>


<p>
She's comforted by inevitability, accepted her fate months ago.
All she feels now is attentive curiosity, a calm anticipation.
The song was written recently, it spread throughout the globe, and was soon broadcast to the stars.
This song was made on earth, forged by the circumstances of its end.
In its death, earth and everyone on it will live forever.
A celebration and a warning, gratitude and mourning.
Mourning of the best kind is truly celebrating; a nostalgic catharsis.
Music which captured that provided comfort for those who remained.
Somehow I imagine many did, though I don't know why.
</p>

<p>
The woman lives this last moment fully, immersed in the sound, the sight of the world around her.
Music softly drifting from her radio as a warm breeze blows through the afternoon air.
What a lovely day, what a lovely moment to be one's last.
Tears at the beauty of what has been, then the world changes and she briefly laments. 
</p>

<p>
Even this is beautiful.
Then there is nothing.
</p>


<p>
I wish I could guess the nature of this doom: I imagine it would be as unfathomable to us as climate change and nuclear warfare to neolithic hunter-gatherers.
By then, I do believe we have mastered ourselves well enough to soothe our way through any circumstance; and endure the greatest calamity with a positive attitude.
To understand the effects and role of art, how our minds interact with our environments.
How can we best experience not just pleasure, but life as a whole?
Feeling fulfillment with all emotions and being grateful for each experience.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<script src="https://utteranc.es/client.js"
        repo="HDictus/HDictus.github.io"
        issue-term="title"
        theme="github-light"
        crossorigin="anonymous"
        type="post"
        async>
      </script>
</div>
</body>
</html>